BellerageHackathon/src/Catalogs/ВерсииТестов/ВерсииТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииТестов</name>
  <owners>Catalog.Тесты</owners>
  <attributes>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВерсии</name>
    <type>
      <types>EnumRef.СтатусыВерсийТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТеста</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитВремениМинуты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБаллПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСхемыОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшСодержимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПубликации</name>
    <type>
      <types>DocumentRef.ПубликацияТеста</types>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/Enums/СтатусыВерсийТестов/СтатусыВерсийТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВерсийТестов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
  <enumValues>
    <name>ЗамененаНовой</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Catalogs/ВерсииТестов/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ИдентификаторВерсии) Тогда
		ИдентификаторВерсии = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтатусВерсии) Тогда
		СтатусВерсии = Перечисления.СтатусыВерсийТестов.Черновик;
	КонецЕсли;

	Если КоличествоПопыток = 0 Тогда
		КоличествоПопыток = 1;
	КонецЕсли;

	Если ПустаяСтрока(ВерсияСхемыОбмена) Тогда
		ВерсияСхемыОбмена = "1.0";
	КонецЕсли;

	ДатаСоздания = ТекущаяДатаСеанса();
	ДатаИзменения = ДатаСоздания;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Владелец) Тогда
		ВызватьИсключение "Версия должна принадлежать тесту.";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторВерсии) Тогда
		ИдентификаторВерсии = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтатусВерсии) Тогда
		СтатусВерсии = Перечисления.СтатусыВерсийТестов.Черновик;
	КонецЕсли;

	Если КоличествоПопыток < 1 Тогда
		ВызватьИсключение "Количество попыток должно быть не меньше одной.";
	КонецЕсли;

	Если ПроходнойБаллПроцентов < 0
		Или ПроходнойБаллПроцентов > 100 Тогда
		ВызватьИсключение "Проходной балл должен быть от 0 до 100.";
	КонецЕсли;

	Если ОграничиватьВремя И ЛимитВремениМинуты < 1 Тогда
		ВызватьИсключение "При ограничении времени лимит должен быть положительным.";
	КонецЕсли;

	Если ДатаСоздания = Дата(1, 1, 1) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	ДатаИзменения = ТекущаяДатаСеанса();

	ПроверитьУникальностьВерсии();

	Если Не ЭтоНовый() Тогда
		СтарыйСтатус = ПолучитьСтарыйСтатус();

		Если СтарыйСтатус = Перечисления.СтатусыВерсийТестов.Опубликована Тогда
			Если СтатусВерсии <> Перечисления.СтатусыВерсийТестов.ЗамененаНовой
				Или ИзмененыНеизменяемыеДанные() Тогда
				ВызватьИсключение "Опубликованную версию нельзя изменять.";
			КонецЕсли;
		ИначеЕсли СтарыйСтатус = Перечисления.СтатусыВерсийТестов.ЗамененаНовой Тогда
			ВызватьИсключение "Замененную версию нельзя изменять.";
		КонецЕсли;
	КонецЕсли;

	Если СтатусВерсии = Перечисления.СтатусыВерсийТестов.Опубликована Тогда
		Если ПустаяСтрока(ХэшСодержимого)
			Или Не ЗначениеЗаполнено(ДокументПубликации)
			Или ДатаПубликации = Дата(1, 1, 1)
			Или МаксимальноеКоличествоБаллов <= 0 Тогда
			ВызватьИсключение "Опубликованная версия должна иметь хэш, дату, документ публикации и максимальный балл.";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПередУдалением(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если СтатусВерсии <> Перечисления.СтатусыВерсийТестов.Черновик Тогда
		Отказ = Истина;
		ВызватьИсключение "Удалять можно только черновую версию теста.";
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьУникальностьВерсии()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Версии.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВерсииТестов КАК Версии
	|ГДЕ
	|	Версии.Ссылка <> &Ссылка
	|	И (Версии.ИдентификаторВерсии = &ИдентификаторВерсии
	|		ИЛИ (Версии.Владелец = &Владелец
	|			И Версии.НомерВерсии = &НомерВерсии))";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторВерсии", ИдентификаторВерсии);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("НомерВерсии", НомерВерсии);

	Если Не Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение "Идентификатор или номер версии уже используется в этом тесте.";
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСтарыйСтатус()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Версии.СтатусВерсии КАК СтатусВерсии
	|ИЗ
	|	Справочник.ВерсииТестов КАК Версии
	|ГДЕ
	|	Версии.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатусВерсии;
	КонецЕсли;

	Возврат Перечисления.СтатусыВерсийТестов.Черновик;

КонецФункции

Функция ИзмененыНеизменяемыеДанные()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Версии.Владелец КАК Владелец,
	|	Версии.ИдентификаторВерсии КАК ИдентификаторВерсии,
	|	Версии.НомерВерсии КАК НомерВерсии,
	|	Версии.ПредыдущаяВерсия КАК ПредыдущаяВерсия,
	|	Версии.НаименованиеТеста КАК НаименованиеТеста,
	|	Версии.ОписаниеТеста КАК ОписаниеТеста,
	|	Версии.ОграничиватьВремя КАК ОграничиватьВремя,
	|	Версии.ЛимитВремениМинуты КАК ЛимитВремениМинуты,
	|	Версии.КоличествоПопыток КАК КоличествоПопыток,
	|	Версии.ПроходнойБаллПроцентов КАК ПроходнойБаллПроцентов,
	|	Версии.ПеремешиватьВопросы КАК ПеремешиватьВопросы,
	|	Версии.МаксимальноеКоличествоБаллов КАК МаксимальноеКоличествоБаллов,
	|	Версии.ВерсияСхемыОбмена КАК ВерсияСхемыОбмена,
	|	Версии.ХэшСодержимого КАК ХэшСодержимого,
	|	Версии.ДатаСоздания КАК ДатаСоздания,
	|	Версии.ДатаПубликации КАК ДатаПубликации,
	|	Версии.ДокументПубликации КАК ДокументПубликации
	|ИЗ
	|	Справочник.ВерсииТестов КАК Версии
	|ГДЕ
	|	Версии.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Не Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Выборка.Владелец <> Владелец
		Или Выборка.ИдентификаторВерсии <> ИдентификаторВерсии
		Или Выборка.НомерВерсии <> НомерВерсии
		Или Выборка.ПредыдущаяВерсия <> ПредыдущаяВерсия
		Или Выборка.НаименованиеТеста <> НаименованиеТеста
		Или Выборка.ОписаниеТеста <> ОписаниеТеста
		Или Выборка.ОграничиватьВремя <> ОграничиватьВремя
		Или Выборка.ЛимитВремениМинуты <> ЛимитВремениМинуты
		Или Выборка.КоличествоПопыток <> КоличествоПопыток
		Или Выборка.ПроходнойБаллПроцентов <> ПроходнойБаллПроцентов
		Или Выборка.ПеремешиватьВопросы <> ПеремешиватьВопросы
		Или Выборка.МаксимальноеКоличествоБаллов <> МаксимальноеКоличествоБаллов
		Или Выборка.ВерсияСхемыОбмена <> ВерсияСхемыОбмена
		Или Выборка.ХэшСодержимого <> ХэшСодержимого
		Или Выборка.ДатаСоздания <> ДатаСоздания
		Или Выборка.ДатаПубликации <> ДатаПубликации
		Или Выборка.ДокументПубликации <> ДокументПубликации;

КонецФункции
